user/tutorials/Nike/shockDroplet_codestream_longer/constant/chem
elements        
3
(
H
O
C
)
;


species        3(C6H14 N2 H2O);


reactions
{
}

Tlow            200;
Thigh           6000;

